# 作者：立志成为大神的小白

# 开发时间：2023/3/18 15:41
#集合间的关系
#1、两个集合是否相等
s1={1,2,3,4}
s2={4,3,2,1}
print(s1==s2)
print(s1!=s2)
#2、判断一个集合是否是另外一个集合的子集----------->issubset()方法打判断
s1={1,2,3,4,5,67}
s2={1,2,3}
print(s1.issubset(s2))
print(s2.issubset(s1))
'''可以看出判断的是调用该方法的集合是否是该方法参数代表集合的子集'''
#3、判断一个集合是否是另外一个集合的超集
s1={1,2,3,4,5,67}
s2={1,2,3}
print(s1.issuperset(s2))
print(s2.issuperset(s1))

print('-----------------------')
#4、判断两个集合是否不含有交集---------------------->两集合有交集返回False,否则返回True
s1={1,2,3,4,5,6,7}
s2={3,4,5,6,7,8,9}
s3={8,9}
print(s1.isdisjoint(s2))
print(s1.isdisjoint(s3))
print(s2.isdisjoint(s3))